package texts

const (
	WelcomeText = "Привет, друг! 👋 Я — твой персональный Помощник, и я здесь, чтобы сделать твой день удобнее!✨\n" +
		"Что я умею:\n☀️ Погода — Узнай текущую погоду в любом городе.\n📝 Заметки — Хочешь ничего не забыть? Добавляй, удаляй и просматривай заметки в пару кликов."
	WeatherText = " - градусов в вашем городе.\nВы также можете узнать какая погода будет"
	NotesText   = "Выберите действие, которое хотите проделать с заметками"

	MyNotesButtonText       = "Мои заметки📝"
	ShowWeatherButtonText   = "Показать погоду🛰️"
	ShowAllNotesButtonText  = "Показать все заметки"
	ClearAllNotesButtonText = "Удалить все заметки"
	AddNoteButtonText       = "Добавить заметку"
	DeleteNoteButtonText    = "Удалить заметку"

	WaitingAddNote    = "Введите текст заметки, которую хотите добавить"
	WaitingDeleteNote = "Введите номер заметки, которую хотите удалить"

	ReplyToUserAddNote    = "Заметка успешно добавлена"
	ReplyToUserDeleteNote = "Заметка успешно удалена"
	ReplyToUserClearNote  = "Все ваши заметки удалены"

	ErrEmptyNoteList = "Ваш список задач пуст. Вы можете добавить задачу нажав на кнопку 'Добавить заметку' "

	MyNotesData       = "myNotes"
	ShowWeatherData   = "showWeather"
	ShowAllNotesData  = "showAllNotes"
	ClearAllNotesData = "clearAllNotes"
	AddNoteData       = "addNote"
	DeleteNoteData    = "deleteNote"
)
